In [1]:
import pandas as pd

In [22]:
df = pd.read_csv("ibge_censo2022.csv", delimiter=",")

In [23]:
df.head()

,id_municipio,cor_raca,sexo,grupo_idade,alfabetizacao,populacao
0,1100023,Indígena,Homens,15 a 19 anos,Não alfabetizadas,NaN
1,1100262,Amarela,Mulheres,15 a 19 anos,Não alfabetizadas,NaN
2,1101005,Amarela,Mulheres,15 a 19 anos,Não alfabetizadas,NaN
3,1101435,Amarela,Mulheres,15 a 19 anos,Não alfabetizadas,NaN
4,1101435,Indígena,Mulheres,15 a 19 anos,Não alfabetizadas,NaN

In [24]:
df = df.fillna(int(0))

In [25]:
df.head()

,id_municipio,cor_raca,sexo,grupo_idade,alfabetizacao,populacao
0,1100023,Indígena,Homens,15 a 19 anos,Não alfabetizadas,0.0
1,1100262,Amarela,Mulheres,15 a 19 anos,Não alfabetizadas,0.0
2,1101005,Amarela,Mulheres,15 a 19 anos,Não alfabetizadas,0.0
3,1101435,Amarela,Mulheres,15 a 19 anos,Não alfabetizadas,0.0
4,1101435,Indígena,Mulheres,15 a 19 anos,Não alfabetizadas,0.0

In [41]:
mulheres = df.groupby(df['sexo'] == 'Mulheres')['alfabetizacao'].count().reset_index()
mulheres

    sexo  alfabetizacao
0  False         389900
1   True         389900